terraform plan when
```
create_dynamodb_table    = false
batch_locking_table_name = "rlm-custom-dynamodb-table"
```
and "rlm-custom-dynamodb-table" is already present, and is used above.

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.geff.data.aws_iam_policy_document.geff_lambda_policy_doc will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "geff_lambda_policy_doc" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-2:123456789:log-group:/aws/lambda/rlm-dev-geff-lambda:*",
            ]
          + sid       = "WriteCloudWatchLogs"
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "WriteCloudWatchMetrics"

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "*",
                ]
              + variable = "cloudwatch:namespace"
            }
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:DescribeImageScanFindings",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:ListImages",
              + "ecr:StartImageScan",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "EcrScanImages"
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:GetObjectVersion",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::rlm-dev-dev-bucket/*",
            ]
          + sid       = "WriteToS3"
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:us-west-2:123456789:function:rlm-dev-geff-lambda",
            ]
          + sid       = "InvokeLambda"
        }
      + statement {
          + actions   = [
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetResourcePolicy",
              + "secretsmanager:GetSecretValue",
              + "secretsmanager:ListSecretVersionIds",
              + "secretsmanager:ListSecrets",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AccessSecrets"
        }
      + statement {
          + actions   = [
              + "secretsmanager:ListSecrets",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "ListSecrets"
        }
    }

  # module.geff.aws_iam_policy.dynamodb_table_policy[0] will be created
  + resource "aws_iam_policy" "dynamodb_table_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "rlm-dev-geff-dynamodb-table-policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:GetItem",
                          + "dynamodb:PutItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-west-2:123456789:table/rlm-custom-dynamodb-table"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = {
          + "environment" = "dev"
        }
    }

  # module.geff.aws_iam_role_policy.geff_lambda_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "geff_lambda_policy" {
        id     = "rlm-dev-geff-lambda:rlm-dev-geff-lambda-policy"
        name   = "rlm-dev-geff-lambda-policy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-west-2:123456789:log-group:/aws/lambda/rlm-dev-geff-lambda:*"
                      - Sid      = "WriteCloudWatchLogs"
                    },
                  - {
                      - Action    = "cloudwatch:PutMetricData"
                      - Condition = {
                          - StringLike = {
                              - "cloudwatch:namespace" = "*"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = "WriteCloudWatchMetrics"
                    },
                  - {
                      - Action   = [
                          - "ecr:StartImageScan",
                          - "ecr:ListImages",
                          - "ecr:DescribeRepositories",
                          - "ecr:DescribeImages",
                          - "ecr:DescribeImageScanFindings",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "EcrScanImages"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObjectVersion",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::rlm-dev-dev-bucket/*"
                      - Sid      = "WriteToS3"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:us-west-2:123456789:function:rlm-dev-geff-lambda"
                      - Sid      = "InvokeLambda"
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:ListSecrets",
                          - "secretsmanager:ListSecretVersionIds",
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AccessSecrets"
                    },
                  - {
                      - Action   = "secretsmanager:ListSecrets"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ListSecrets"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.geff.aws_iam_role_policy_attachment.dynamodb_table_policy_attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dynamodb_table_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "rlm-dev-geff-lambda"
    }

  # module.geff.aws_lambda_function.geff_lambda will be updated in-place
  ~ resource "aws_lambda_function" "geff_lambda" {
        id                             = "rlm-dev-geff-lambda"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMODB_TABLE_NAME" = "rlm-custom-dynamodb-table"
                # (3 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
